kmmankad/EzI2C_WaveformViewer/I2C_Slave.cydsn/Generated_Source/PSoC3/ADC.c
/*******************************************************************************
* File Name: ADC.c  
* Version 2.20
*
* Description:
*  This file provides the source code to the API for the Delta-Sigma ADC
*  Component.
*
* Note:
*
*******************************************************************************
* Copyright 2008-2011, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "ADC.h"

#if(ADC_DEFAULT_INTERNAL_CLK)
    #include "ADC_theACLK.h"
#endif /* ADC_DEFAULT_INTERNAL_CLK */

#if(ADC_DEFAULT_CHARGE_PUMP_CLOCK)
    #include "ADC_Ext_CP_Clk.h"
#endif /* ADC_DEFAULT_CHARGE_PUMP_CLOCK */

#if(ADC_DEFAULT_INPUT_MODE)
    #include "ADC_AMux.h"
#endif /* ADC_DEFAULT_INPUT_MODE */

/* Software flag for checking conversion completed or not */
volatile uint8 ADC_convDone = 0u;

/* Software flag to stop conversion for single sample conversion mode 
   with resolution above 16 bits */
volatile uint8 ADC_stopConversion = 0u;

/* To run the initialization block only at the start up */
uint8 ADC_initVar = 0u;

/* To check whether ADC started or not before switching the configuration */
volatile uint8 ADC_started = 0u;

volatile int32 ADC_Offset = 0u;
volatile int32 ADC_CountsPerVolt = (uint32)ADC_CFG1_COUNTS_PER_VOLT;

/* Only valid for PSoC5 ES1 */
/* Variable to decide whether or not to restore the register values from
    backup structure */
#if (CY_PSOC5_ES1)
    uint8 ADC_restoreReg = 0u;
#endif /* CY_PSOC5_ES1 */

/* Valid only for PSoC5 ES2 silicon */
#if (CY_PSOC5_ES1)
    /* Backup struct for power mode registers */
    static ADC_POWERMODE_BACKUP_STRUCT ADC_powerModeBackup = 
    {
        /* Initializing the structure fields with power mode registers of 
           config1 */
        ADC_CFG1_DSM_CR14,
        ADC_CFG1_DSM_CR15,
        ADC_CFG1_DSM_CR16,
        ADC_CFG1_DSM_CR17,
        ADC_CFG1_DSM_REF0,
        ADC_CFG1_DSM_BUF0,
        ADC_CFG1_DSM_BUF1,
        ADC_CFG1_DSM_CLK,
        ADC_BYPASS_DISABLED
    };
#endif /* CY_PSOC5_ES1 */


/****************************************************************************** 
* Function Name: ADC_Init
*******************************************************************************
*
* Summary:
*  Initialize component's parameters to the parameters set by user in the 
*  customizer of the component placed onto schematic. Usually called in 
* ADC_Start().
*  
*
* Parameters:  
*  void
*
* Return: 
*  void 
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
void ADC_Init(void) 
{
    /* Initialize the registers with default customizer settings for config1 */
    ADC_InitConfig(1);

    /* This is only valid if there is an internal clock */
    #if(ADC_DEFAULT_INTERNAL_CLK)
        ADC_theACLK_SetMode(CYCLK_DUTY);
    #endif /* ADC_DEFAULT_INTERNAL_CLK */
    
    /* This is only valid if there is an external charge pump clock */
    #if(ADC_DEFAULT_CHARGE_PUMP_CLOCK)
        ADC_Ext_CP_Clk_SetMode(CYCLK_DUTY);
    #endif /* ADC_DEFAULT_CHARGE_PUMP_CLOCK */

    /* To perform ADC calibration */
    ADC_GainCompensation(ADC_CFG1_RANGE, 
                                      ADC_CFG1_IDEAL_DEC_GAIN, 
                                      ADC_CFG1_IDEAL_ODDDEC_GAIN, 
                                      ADC_CFG1_RESOLUTION);        
}


/******************************************************************************
* Function Name: ADC_Enable
*******************************************************************************
*
* Summary: 
*  Enables the ADC DelSig block operation.
*  
*
* Parameters:  
*  void
*
* Return: 
*  void 
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
void ADC_Enable(void) 
{
    /* Restore the power registers if silicon used is PSoC5 ES1 */
    #if (CY_PSOC5_ES1)
        if(ADC_restoreReg && 
           (!(ADC_powerModeBackup.bypassRestore)))
        {
            ADC_RestorePowerRegisters();
            ADC_restoreReg = 0u;
        }
        ADC_powerModeBackup.bypassRestore = ADC_BYPASS_DISABLED;
    #endif /* CY_PSOC5_ES1 */

    /* Enable active mode power for ADC */
    ADC_PWRMGR_DEC_REG |= ADC_ACT_PWR_DEC_EN;
    ADC_PWRMGR_DSM_REG |= ADC_ACT_PWR_DSM_EN;
    
     /* Enable alternative active mode power for ADC */
    ADC_STBY_PWRMGR_DEC_REG |= ADC_STBY_PWR_DEC_EN;
    #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
    ADC_STBY_PWRMGR_DSM_REG |= ADC_STBY_PWR_DSM_EN;
    #endif /* CY_PSOC3_ES3 || CY_PSOC5_ES2 */

    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and REFBUF1, enable 
       PRES */
    #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
        ADC_RESET_CR4_REG |= ADC_IGNORE_PRESA1;
        ADC_RESET_CR5_REG |= ADC_IGNORE_PRESA2;
    #elif (CY_PSOC5_ES1 || CY_PSOC3_ES2)
        ADC_RESET_CR1_REG |= ADC_DIS_PRES1;
        ADC_RESET_CR3_REG |= ADC_DIS_PRES2;
    #endif /* CY_PSOC5_ES1 || CY_PSOC3_ES2 */
    
    ADC_DSM_CR17_REG |= (ADC_DSM_EN_BUF_VREF | ADC_DSM_EN_BUF_VCM);
    #if ((ADC_CFG1_REFERENCE == ADC_EXT_REF_ON_P03) || \
         (ADC_CFG1_REFERENCE == ADC_EXT_REF_ON_P32))
        ADC_DSM_CR17_REG &= ~ADC_DSM_EN_BUF_VREF;
    #endif /* Check for exteranl reference option */
    #if ((ADC_CFG1_RANGE == ADC_IR_VSSA_TO_2VREF) && \
          (CY_PSOC3_ES3 || CY_PSOC5_ES2) && \
          ((ADC_CFG1_REFERENCE != ADC_EXT_REF_ON_P03) && \
         (ADC_CFG1_REFERENCE != ADC_EXT_REF_ON_P32)))
        ADC_DSM_REF0_REG |= ADC_DSM_EN_BUF_VREF_INN;
    #endif /* ADC_IR_VSSA_TO_2VREF */
    
        /* Wait for 3 microseconds */
    CyDelayUs(3);
    
    #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
        ADC_RESET_CR4_REG &= ~ADC_IGNORE_PRESA1;
        ADC_RESET_CR5_REG &= ~ADC_IGNORE_PRESA2;
        
        ADC_RESET_CR3_REG = ADC_EN_PRESA;
    #elif (CY_PSOC5_ES1 || CY_PSOC3_ES2)
        ADC_RESET_CR1_REG &= ~ADC_DIS_PRES1;
        ADC_RESET_CR3_REG &= ~ADC_DIS_PRES2;
    #endif /* CY_PSOC5_ES1 || CY_PSOC3_ES2 */
    
    /* Enable negative pumps for DSM  */
    ADC_PUMP_CR1_REG  |= ( ADC_PUMP_CR1_CLKSEL | ADC_PUMP_CR1_FORCE );
 
    /* This is only valid if there is an internal clock */
    #if(ADC_DEFAULT_INTERNAL_CLK)
        ADC_PWRMGR_CLK_REG |= ADC_ACT_PWR_CLK_EN;        
        ADC_STBY_PWRMGR_CLK_REG |= ADC_STBY_PWR_CLK_EN;
        
