kmmankad/EzI2C_WaveformViewer/I2C_Slave.cydsn/Generated_Source/PSoC3/ADC.c
        ADC_theACLK_Enable();
    #endif /* ADC_DEFAULT_INTERNAL_CLK */
    
    /* This is only valid if there is an external charge pump clock */
    #if(ADC_DEFAULT_CHARGE_PUMP_CLOCK)
        ADC_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_ACT_PWR_CHARGE_PUMP_CLK_EN;
        ADC_STBY_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_STBY_PWR_CHARGE_PUMP_CLK_EN;
        
        ADC_Ext_CP_Clk_Enable();
    #endif /* ADC_DEFAULT_CHARGE_PUMP_CLOCK */

}


#if (CY_PSOC5_ES1) /* valid only for PSoC5 ES1 silicon */
    /******************************************************************************* 
    * Function Name: ADC_RestorePowerRegisters
    ********************************************************************************
    *
    * Summary: 
    *  Restores the power registers on calling Start() API. This API is only 
    *   for internal use and valid only for PSoC5 ES1.
    *  
    *
    * Parameters:  
    *  void
    *
    * Return: 
    *  void 
    *
    * Reentrance: 
    *  Yes
    *
    ***************************************************************************/
    void ADC_RestorePowerRegisters(void)
    {
        ADC_DSM_CR14_REG = ADC_powerModeBackup.DSM_CR_14;
        ADC_DSM_CR15_REG = ADC_powerModeBackup.DSM_CR_15;
        ADC_DSM_CR16_REG = ADC_powerModeBackup.DSM_CR_16;
        ADC_DSM_CR17_REG = ADC_powerModeBackup.DSM_CR_17;
        ADC_DSM_REF0_REG = ADC_powerModeBackup.DSM_REF0;
        ADC_DSM_BUF0_REG = ADC_powerModeBackup.DSM_BUF0;
        ADC_DSM_BUF1_REG = ADC_powerModeBackup.DSM_BUF1;
        ADC_DSM_CLK_REG = ADC_powerModeBackup.DSM_CLK;
    }


    /************************************************************************** 
    * Function Name: ADC_SavePowerRegisters
    ***************************************************************************
    *
    * Summary: 
    *  Save the power registers before stopping the block operation. This is 
    *  called by Stop() API. This API is only for internal use and valid only 
    *  for PSoC5 ES1.
    *  
    *
    * Parameters:  
    *  void
    *
    * Return: 
    *  void 
    *
    * Reentrance: 
    *  Yes
    *
    **************************************************************************/
    void ADC_SavePowerRegisters(void)
    {
        ADC_powerModeBackup.DSM_CR_14 = ADC_DSM_CR14_REG;
        ADC_powerModeBackup.DSM_CR_15 = ADC_DSM_CR15_REG;
        ADC_powerModeBackup.DSM_CR_16 = ADC_DSM_CR16_REG;
        ADC_powerModeBackup.DSM_CR_17 = ADC_DSM_CR17_REG;
        ADC_powerModeBackup.DSM_REF0 = ADC_DSM_REF0_REG;
        ADC_powerModeBackup.DSM_BUF0 = ADC_DSM_BUF0_REG;
        ADC_powerModeBackup.DSM_BUF1 = ADC_DSM_BUF1_REG;
        ADC_powerModeBackup.DSM_CLK = ADC_DSM_CLK_REG;
    }


    /************************************************************************* 
    * Function Name: ADC_SetLowPower
    ***************************************************************************
    *
    * Summary: 
    *  Set all the power registers of DSM block to low power mode. This API is
    *   called by Stop() API. This API is only for internal use and valid for 
    *   only PSoC5 ES1.
    *  
    *
    * Parameters:  
    *  void
    *
    * Return: 
    *  void 
    *
    * Reentrance: 
    *  Yes
    *
    ***************************************************************************/
    void ADC_SetLowPower(void)
    {
        ADC_DSM_CR14_REG &= ~ADC_DSM_POWER1_MASK;
        ADC_DSM_CR14_REG |= ADC_DSM_POWER1_44UA;
        
        ADC_DSM_CR15_REG &= ~(ADC_DSM_POWER2_3_MASK | ADC_DSM_POWER_COMP_MASK);
        ADC_DSM_CR15_REG |= (ADC_DSM_POWER2_3_LOW | ADC_DSM_POWER_VERYLOW);
        
        ADC_DSM_CR16_REG &= ~(ADC_DSM_CP_PWRCTL_MASK | ADC_DSM_POWER_SUM_MASK |
                                           ADC_DSM_CP_ENABLE);
        ADC_DSM_CR16_REG |= (ADC_DSM_POWER_SUM_LOW | ADC_DSM_CP_PWRCTL_LOW);
        
        ADC_DSM_CR17_REG &= ~(ADC_DSM_EN_BUF_VREF | ADC_DSM_PWR_CTRL_VCM_MASK |
                                           ADC_DSM_PWR_CTRL_VREF_MASK | ADC_DSM_EN_BUF_VCM |
                                           ADC_DSM_PWR_CTRL_VREF_INN_MASK);
        ADC_DSM_CR17_REG |= (ADC_DSM_PWR_CTRL_VREF_0 | ADC_DSM_PWR_CTRL_VCM_0 |
                                           ADC_DSM_PWR_CTRL_VREF_INN_0);
        
        /* Disable reference buffers */
        ADC_DSM_REF0_REG &= ~(ADC_DSM_EN_BUF_VREF_INN | ADC_DSM_VREF_RES_DIV_EN |
                                           ADC_DSM_VCM_RES_DIV_EN);
            
        /* Disable the positive input buffer */
        ADC_DSM_BUF0_REG &= ~ADC_DSM_ENABLE_P;
        /* Disable the negative input buffer */
        ADC_DSM_BUF1_REG &= ~ADC_DSM_ENABLE_N;
        /* Disable the clock to DSM */
        ADC_DSM_CLK_REG &= ~(ADC_DSM_CLK_CLK_EN | ADC_DSM_CLK_BYPASS_SYNC);
    }
#endif /* CY_PSOC5_ES1 */


/******************************************************************************* 
* Function Name: ADC_Start
********************************************************************************
*
* Summary:
*  The start function initializes the Delta Sigma Modulator with the default  
*  values, and sets the power to the given level.  A power level of 0, is the 
*  same as executing the stop function.
*
* Parameters:  
*  None
*
* Return: 
*  void 
*
* Global variables:
*  ADC_initVar:  Used to check the initial configuration,
*  modified when this function is called for the first time.

*
* Reetrance: 
*  No
*
*******************************************************************************/
void ADC_Start() 
{
    if(ADC_initVar == 0u)
    {
        if(!(ADC_started))
        {
            ADC_Init();
        }
        ADC_initVar = 1u;
    }

    /* Enable the ADC */
    ADC_Enable();
}


/*******************************************************************************
* Function Name: ADC_Stop
********************************************************************************
*
* Summary:
*  Stops and powers down ADC to lowest power state.
*
* Parameters:  
*  void
*
* Return: 
*  void 
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
void ADC_Stop(void) 
{
    /* Stop conversions */
    ADC_DEC_CR_REG &= ~ADC_DEC_START_CONV;
    ADC_DEC_SR_REG |=  ADC_DEC_INTR_CLEAR;
    
    /* Disable PRES, Disable power to VCMBUF0, REFBUF0 and REFBUF1, 
       enable PRES */
    #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
        ADC_RESET_CR4_REG |= ADC_IGNORE_PRESA1;
        ADC_RESET_CR5_REG |= ADC_IGNORE_PRESA2;
    #elif (CY_PSOC5_ES1 || CY_PSOC3_ES2)
        ADC_RESET_CR1_REG |= ADC_DIS_PRES1;
        ADC_RESET_CR3_REG |= ADC_DIS_PRES2;
    #endif /* CY_PSOC5_ES1 || CY_PSOC3_ES2 */
    
