kmmankad/EzI2C_WaveformViewer/I2C_Slave.cydsn/Generated_Source/PSoC3/ADC.c
    ADC_DSM_CR17_REG &= ~(ADC_DSM_EN_BUF_VREF | ADC_DSM_EN_BUF_VCM);
    ADC_DSM_REF0_REG &= ~ADC_DSM_EN_BUF_VREF_INN;
    
    /* Wait for 3 microseconds. */
    CyDelayUs(3);
    
    #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
        ADC_RESET_CR4_REG &= ~ADC_IGNORE_PRESA1;
        ADC_RESET_CR5_REG &= ~ADC_IGNORE_PRESA2;
        
        /* Enable the press circuit */
        ADC_RESET_CR3_REG = ADC_EN_PRESA;
    #elif (CY_PSOC5_ES1 || CY_PSOC3_ES2)
        ADC_RESET_CR1_REG &= ~ADC_DIS_PRES1;
        ADC_RESET_CR3_REG &= ~ADC_DIS_PRES2;
    #endif /* CY_PSOC5_ES1 || CY_PSOC3_ES2 */
    
    /* If PSoC5 ES1 then don't disable the power instead put the block to  
       low power mode. Also, save current state of all the power configuration 
       registers before putting block to low power mode */
    #if (CY_PSOC5_ES1)
        
        /* set the flag */
        ADC_restoreReg = 1u;
        
        ADC_SavePowerRegisters();
        ADC_SetLowPower();
    #else    
        /* Disable power to the ADC */
        ADC_PWRMGR_DSM_REG &= ~ADC_ACT_PWR_DSM_EN;
    #endif /* CY_PSOC5_ES1 */
    
    /* Disable power to Decimator block */
    ADC_PWRMGR_DEC_REG &= ~ADC_ACT_PWR_DEC_EN;
    
    /* Disable alternative active power to the ADC */
    ADC_STBY_PWRMGR_DEC_REG &= ~ADC_STBY_PWR_DEC_EN;
    #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
    ADC_STBY_PWRMGR_DSM_REG &= ~ADC_STBY_PWR_DSM_EN;
    #endif /* CY_PSOC3_ES3 || CY_PSOC5_ES2 */

   /* Disable negative pumps for DSM  */
    ADC_PUMP_CR1_REG &= ~(ADC_PUMP_CR1_CLKSEL | ADC_PUMP_CR1_FORCE );
    
    /* This is only valid if there is an internal clock */
    #if(ADC_DEFAULT_INTERNAL_CLK)
        ADC_PWRMGR_CLK_REG &= ~ADC_ACT_PWR_CLK_EN;
        ADC_STBY_PWRMGR_CLK_REG &= ~ADC_STBY_PWR_CLK_EN;
        
        ADC_theACLK_Disable();
    #endif /* ADC_DEFAULT_INTERNAL_CLK */
    
    /* This is only valid if there is an external charge pump clock */
    #if(ADC_DEFAULT_CHARGE_PUMP_CLOCK)
        ADC_PWRMGR_CHARGE_PUMP_CLK_REG &= ~ADC_ACT_PWR_CHARGE_PUMP_CLK_EN;
        ADC_STBY_PWRMGR_CHARGE_PUMP_CLK_REG &= ~ADC_STBY_PWR_CHARGE_PUMP_CLK_EN;
        
        ADC_Ext_CP_Clk_Disable();
    #endif /* ADC_DEFAULT_CHARGE_PUMP_CLOCK */    
}


/*******************************************************************************
* Function Name: ADC_SetBufferGain
********************************************************************************
*
* Summary:
*  Set input buffer range.
*
* Parameters:  
*  gain:  Two bit value to select a gain of 1, 2, 4, or 8.
*
* Return: 
*  void
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
void ADC_SetBufferGain(uint8 gain) 
{
    uint8 tmpReg;
    tmpReg = ADC_DSM_BUF1_REG & ~ADC_DSM_GAIN_MASK;
    tmpReg |= (gain << 2);
    ADC_DSM_BUF1_REG = tmpReg;
}


/*******************************************************************************
* Function Name: ADC_SetCoherency
********************************************************************************
*
* Summary:
*  Sets the ADC output register coherency bit.
*
* Parameters:  
*  gain:  Two bit value to set the coherency bit.
          00-Coherency checking off
          01-low byte is key byte
          02-middle byte is the key byte
          03-high byte is the key byte
*
* Return: 
*  void
*
* Side Effects:  If the coherency is changed, for any reason, it should be 
*                changed back to the LSB when the provided “GetResult” API 
*                is used.
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
void ADC_SetCoherency(uint8 coherency) 
{
    uint8 tmpReg;    
    tmpReg = ADC_DEC_COHER_REG & ~ADC_DEC_SAMP_KEY_MASK;
    tmpReg |= coherency;
    ADC_DEC_COHER_REG = tmpReg;
}


/*******************************************************************************
* Function Name: ADC_SetGCOR
********************************************************************************
*
* Summary:
*  Calculates a new GCOR value and writes it into the GCOR register.
*
* Parameters:  
*  gainAdjust:  floating point value to set GCOR registers.
*
* Return: 
*  uint8:  0-if GCOR value is within the expected range.
           1- if GCOR is outside the expected range.
*
* Side Effects:  The GVAL register is set to the amount of valid bits in the
*                GCOR  register minus one. If GVAL is 15 (0x0F), all 16 bits
*                of the GCOR registers will be valid. If for example GVAL is 
*                11 (0x0B) only 12 bits will be valid. The least 4 bits will
*                be lost when the GCOR value is shifted 4 places to the right.
*
* Reentrance: 
*  Yes
*
******************************************************************************/
uint8 ADC_SetGCOR(float gainAdjust) 
{
    uint16 tmpReg;
    uint8 status;
    float tmpValue;
    
    tmpReg = ADC_DEC_GCORH_REG;
    tmpReg = (tmpReg << 8) | ADC_DEC_GCOR_REG;
    tmpValue = ((float)tmpReg / ADC_IDEAL_GAIN_CONST);
    tmpValue = tmpValue * gainAdjust;
    
    if (tmpValue > 1.9999)
    {
        status = 1;
    }
    else
    {
        tmpReg = (uint16)(tmpValue * ADC_IDEAL_GAIN_CONST);
        ADC_DEC_GCOR_REG = (uint8)tmpReg;
        ADC_DEC_GCORH_REG = (uint8) (tmpReg >> 8);
        status = 0;
    }
    
    return status;
}


/******************************************************************************
* Function Name: ADC_ReadGCOR
*******************************************************************************
*
* Summary:
*  This API returns the current GCOR register value, normalized based on the 
*  GVAL register settings.
*
* Parameters:  
*  void
*
* Return: 
*  uint16:  Normalized GCOR value.
*
* Side Effects:  If the GVAL register is set to a value greater than 0x0F, then
                 it gives unexpected value.
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
uint16 ADC_ReadGCOR(void) 
{
    uint8 gValue;
    uint16 gcorValue, gcorRegValue;
    
    gValue = ADC_DEC_GVAL_REG;
    gcorRegValue = CY_GET_REG16(ADC_DEC_GCOR_PTR);
    
    switch (gValue)
    {
        case ADC_GVAL_RESOLUTIN_8:
            gcorValue = gcorRegValue << (ADC_MAX_GVAL - gValue);
            break;
        
        case ADC_GVAL_RESOLUTIN_9:
            gcorValue = gcorRegValue << (ADC_MAX_GVAL - gValue);
            break;
            
        case ADC_GVAL_RESOLUTIN_10:
            gcorValue = gcorRegValue << (ADC_MAX_GVAL - gValue);
            break;
            
