kmmankad/EzI2C_WaveformViewer/I2C_Slave.cydsn/Generated_Source/PSoC3/ADC.c
        case ADC_GVAL_RESOLUTIN_11:
            gcorValue = gcorRegValue << (ADC_MAX_GVAL - gValue);
            break;
            
        case ADC_GVAL_RESOLUTIN_12:
            gcorValue = gcorRegValue << (ADC_MAX_GVAL - gValue);
            break;
            
        case ADC_GVAL_RESOLUTIN_13:
            gcorValue = gcorRegValue << (ADC_MAX_GVAL - gValue);
            break;
            
        default:
            gcorValue = gcorRegValue;
            break;
    }
        
    return gcorValue;
}


/*******************************************************************************
* Function Name: ADC_SetBufferChop
********************************************************************************
*
* Summary:
*  Sets the Delta Sigma Modulator Buffer chopper mode.
*
* Parameters:  
*  chopen:  If non-zero set the chopper mode.
*  chopFreq:  Chop frequency value.
*
* Return: 
*  void
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
void ADC_SetBufferChop(uint8 chopen, uint8 chopFreq) 
{
    if(chopen != 0u)
    {
        ADC_DSM_BUF2_REG = (ADC_DSM_BUF_FCHOP_MASK & chopFreq) | \
                                         ADC_DSM_BUF_CHOP_EN;
    }
    else
    {
        ADC_DSM_BUF2_REG = 0x00u;
    }
}


/*******************************************************************************
* Function Name: ADC_StartConvert
********************************************************************************
*
* Summary:
*  Starts ADC conversion using the given mode.
*
* Parameters:  
*  void
*
* Return: 
*  void 
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
void ADC_StartConvert(void) 
{
    /* Start the conversion */
    ADC_DEC_CR_REG |= ADC_DEC_START_CONV;  
}


/*******************************************************************************
* Function Name: ADC_StopConvert
********************************************************************************
*
* Summary:
*  Starts ADC conversion using the given mode.
*
* Parameters:  
*  void
*
* Return: 
*  void
*
* Global variables:
*  ADC_convDone:  Modified when conversion is complete for single
*   sample mode with resolution is above 16.
*
* Reentrance: 
*  No
*
*******************************************************************************/
void ADC_StopConvert(void)
{
    /* Stop all conversions */
    ADC_DEC_CR_REG &= ~ADC_DEC_START_CONV; 
    
    /* Software flag for checking conversion complete or not. Will be used when
       resolution is above 16 bits and conversion mode is single sample */
    ADC_convDone = 1u;
}


/*******************************************************************************
* Function Name: ADC_IsEndConversion
********************************************************************************
*
* Summary:
*  Queries the ADC to see if conversion is complete
*
* Parameters:  
*  wMode:  Wait mode, 0 if return with answer immediately.
*                     1 if wait until conversion is complete, then return.
*
* Return: 
*  uint8 status:  0 =>  Conversion not complete.
*                 1 =>  Conversion complete.
*
* Global variables:
*  ADC_convDone:  Used to check whether conversion is complete
*  or not for single sample mode with resolution is above 16
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
uint8 ADC_IsEndConversion(uint8 wMode) 
{
    uint8 status;
        
    /* Check for stop convert if conversion mode is Single Sample with 
       resolution above 16 bit */
    if(ADC_stopConversion == 1u)
    {
        do
        {
            status = ADC_convDone;
        } while((status != ADC_DEC_CONV_DONE) && (wMode == ADC_WAIT_FOR_RESULT));
    }
    else
    {
        do 
        {
            status = ADC_DEC_SR_REG & ADC_DEC_CONV_DONE;
        } while((status != ADC_DEC_CONV_DONE) && (wMode == ADC_WAIT_FOR_RESULT));
    }
    return(status);
}


/*******************************************************************************
* Function Name: ADC_GetResult8
********************************************************************************
*
* Summary:
*  Returns an 8-bit result or the LSB of the last conversion.
*
* Parameters:  
*  void
*
* Return: 
*  int8:  ADC result.
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
int8 ADC_GetResult8( void ) 
{
     return( ADC_DEC_SAMP_REG );
}


/*******************************************************************************
* Function Name: ADC_GetResult16
********************************************************************************
*
* Summary:
*  Returns a 16-bit result from the last ADC conversion.
*
* Parameters:  
*   void
*
* Return: 
*  int16:  ADC result.
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
int16 ADC_GetResult16(void) 
{
    uint16 result;
    
    #if (CY_PSOC3)
        result = ADC_DEC_SAMPM_REG ;
        result = (result << 8 ) | ADC_DEC_SAMP_REG;
    #else
        result = (CY_GET_REG16(ADC_DEC_SAMP_PTR));
    #endif /* CY_PSOC3 */
    
    return result;
}


/*******************************************************************************
* Function Name: ADC_GetResult32
********************************************************************************
*
* Summary:
*  Returns an 32-bit result from ADC
*
* Parameters:  
*  void
*
* Return: 
*  int32:  ADC result.
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
int32 ADC_GetResult32(void) 
{
    uint32 result;

    #if (CY_PSOC3)
        /* to make upper bits fo result to 0 */
        result = (int8) (0xff & ADC_DEC_SAMPH_REG); 
        result = (result << 8) | ADC_DEC_SAMPM_REG;
        result = (result << 8) | ADC_DEC_SAMP_REG;
    #else
        result = CY_GET_REG16(ADC_DEC_SAMPH_PTR);
        result = (result << 16) | (CY_GET_REG16(ADC_DEC_SAMP_PTR));
    #endif /* CY_PSOC3 */
    
    return result;
}


