kmmankad/EzI2C_WaveformViewer/I2C_Slave.cydsn/Generated_Source/PSoC3/ADC.c
/*******************************************************************************
* Function Name: ADC_SetOffset
********************************************************************************
*
* Summary:
*  This function sets the offset for voltage readings.
*
* Parameters:  
*  int32:  offset  Offset in counts
*
* Return: 
*  void
*
* Global variables:
*  ADC_Offset:  Modified to set the user provided offset. This 
*  variable is used for offset calibration purpose.
*  Affects the ADC_CountsTo_Volts, 
*  ADC_CountsTo_mVolts, ADC_CountsTo_uVolts functions 
*  by subtracting the given offset. 
*
* Reentrance: 
*  No
*
*******************************************************************************/
void ADC_SetOffset(int32 offset)
{
 
    ADC_Offset = offset;
}


/*******************************************************************************
* Function Name: ADC_SetGain
********************************************************************************
*
* Summary:
*  This function sets the ADC gain in counts per volt.
*
* Parameters:  
*  int32:  offset  Offset in counts
*
* Return: 
*  void 
*
* Global variables:
*  ADC_CountsPerVolt:  modified to set the ADC gain in counts 
*   per volt.
*
* Reentrance: 
*  No
*
*******************************************************************************/
void ADC_SetGain(int32 adcGain)
{
 
    ADC_CountsPerVolt = adcGain;
}


/*******************************************************************************
* Function Name: ADC_CountsTo_mVolts
********************************************************************************
*
* Summary:
*  This function converts ADC counts to mVolts.
*
* Parameters:  
*  int32:  adcCounts   Reading from ADC.
*
* Return: 
*  int32:  Result in mVolts
*
* Global variables:
*  ADC_CountsPerVolt:  used to convert ADC counts to mVolts.
*  ADC_Offset:  Used as the offset while converting ADC counts 
*   to mVolts.
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
int16 ADC_CountsTo_mVolts( int32 adcCounts) 
{

    int32 mVolts = 0;
    int32 A, B;

    /* Subtract ADC offset */
    adcCounts -= ADC_Offset;

    if(ADC_CFG1_RESOLUTION < 17)
    {
        A = 1000;
        B = 1;
    }
    else
    {
        A = 100;
        B = 10;
    }

    mVolts = ((A * adcCounts) / ((int32)ADC_CountsPerVolt/B)) ;   

    return( (int16)mVolts );
}


/*******************************************************************************
* Function Name: ADC_CountsTo_Volts
********************************************************************************
*
* Summary:
*  This function converts ADC counts to Volts
*
* Parameters:  
*  int32:  adcCounts   Reading from ADC.
*
* Return: 
*  float:  Result in Volts
*
* Global variables:
*  ADC_CountsPerVolt:  used to convert to Volts.
*  ADC_Offset:  Used as the offset while converting ADC counts 
*   to Volts.
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
float ADC_CountsTo_Volts( int32 adcCounts) 
{

    float Volts = 0;

    /* Subtract ADC offset */
    adcCounts -= ADC_Offset;

    Volts = (float)adcCounts / (float)ADC_CountsPerVolt;   
    
    return( Volts );
}


/*******************************************************************************
* Function Name: ADC_CountsTo_uVolts
********************************************************************************
*
* Summary:
*  This function converts ADC counts to uVolts
*
* Parameters:  
*  int32:  adcCounts   Reading from ADC.
*
* Return: 
*  int32:  Result in uVolts
*
* Global variables:
*  ADC_CountsPerVolt:  used to convert ADC counts to mVolts.
*  ADC_Offset:  Used as the offset while converting ADC counts 
*   to mVolts.
*
* Theory: 
* Care must be taken to not exceed the maximum value for a 32 bit signed
* number in the conversion to uVolts and at the same time not loose 
* resolution.
*
* uVolts = ((A * adcCounts) / ((int32)ADC_CountsPerVolt/B)) ;   
*
*  Resolution       A           B
*   8 - 11      1,000,000         1
*  12 - 14        100,000        10
*  15 - 17         10,000       100
*  18 - 20           1000      1000
*
* Reentrance:
*  Yes
*
*******************************************************************************/
int32 ADC_CountsTo_uVolts( int32 adcCounts) 
{

    int32 uVolts = 0;
    int32 A, B;
    
    if(ADC_CFG1_RESOLUTION < 12)
    {
        A = 1000000;
        B = 1;
    }
    else if(ADC_CFG1_RESOLUTION < 15)
    {
        A = 100000;
        B = 10;
    }
    else if(ADC_CFG1_RESOLUTION < 18)
    {
        A = 10000;
        B = 100;
    }
    else
    {
        A = 1000;
        B = 1000;
    }

    /* Subtract ADC offset */
    adcCounts -= ADC_Offset;

    uVolts = ((A * adcCounts) / ((int32)ADC_CountsPerVolt/B)) ;   
  
    return( uVolts );
}


/*******************************************************************************
* Function Name: ADC_IRQ_Start(void)
********************************************************************************
*
* Summary:
*  Set up the interrupt and enable it. The IRQ_Start() API is included to 
*  support legacy code. The routine has been replaced by the library source 
*  code for interrupts. IRQ_Start() should not be used in new designs.
* 
* Parameters:  
*   void.
*
* Return:
*   void.
*
* Reentrance:
*  No
*
*******************************************************************************/
void ADC_IRQ_Start(void) 
{
    /* For all we know the interrupt is active. */
    CyIntDisable(ADC_IRQ__INTC_NUMBER );

    /* Set the ISR to point to the ADC_DelSig_1_IRQ Interrupt. */
    CyIntSetVector(ADC_IRQ__INTC_NUMBER, ADC_ISR1);

    /* Set the priority. */
    CyIntSetPriority(ADC_IRQ__INTC_NUMBER, ADC_IRQ_INTC_PRIOR_NUMBER);

    /* Enable interrupt. */
    CyIntEnable(ADC_IRQ__INTC_NUMBER);
}


/*******************************************************************************
* Function Name: ADC_InitConfig(uint8 config)
********************************************************************************
*
* Summary:
*  Initializes all registers based on customizer settings
*
* Parameters:  
*   void
*
* Return: 
*  void
*
* Global variables:
*  ADC_initVar:  used to set the common registers in the beginning.
*  ADC_CountsPerVolt:  Used to set the default counts per volt.
*
* Reentrance: 
*  No
*
*******************************************************************************/
void ADC_InitConfig(uint8 config)
{
    ADC_stopConversion = 0u;
    
    if(ADC_initVar == 0u)
        {
            ADC_DSM_DEM0_REG    = ADC_CFG1_DSM_DEM0;    
            ADC_DSM_DEM1_REG    = ADC_CFG1_DSM_DEM1;    
            ADC_DSM_MISC_REG    = ADC_CFG1_DSM_MISC;    
            ADC_DSM_CLK_REG    |= ADC_CFG1_DSM_CLK; 
            ADC_DSM_REF1_REG    = ADC_CFG1_DSM_REF1;    
        
            ADC_DSM_OUT0_REG    = ADC_CFG1_DSM_OUT0;    
            ADC_DSM_OUT1_REG    = ADC_CFG1_DSM_OUT1;   
        
