kmmankad/EzI2C_WaveformViewer/I2C_Slave.cydsn/Generated_Source/PSoC3/ADC.c
            ADC_DSM_CR0_REG     = ADC_CFG1_DSM_CR0;     
            ADC_DSM_CR1_REG     = ADC_CFG1_DSM_CR1;     
            ADC_DSM_CR2_REG     = ADC_CFG1_DSM_CR2;     
            ADC_DSM_CR3_REG     = ADC_CFG1_DSM_CR3;     
            ADC_DSM_CR13_REG    = ADC_CFG1_DSM_CR13;     
            
            ADC_DEC_SR_REG      = ADC_CFG1_DEC_SR;      
            ADC_DEC_COHER_REG   = ADC_CFG1_DEC_COHER;   
        }

    if (config == 1u)
    {
        /* Default Config */   
        ADC_DEC_CR_REG      = ADC_CFG1_DEC_CR;      
        ADC_DEC_SHIFT1_REG  = ADC_CFG1_DEC_SHIFT1;  
        ADC_DEC_SHIFT2_REG  = ADC_CFG1_DEC_SHIFT2;  
        ADC_DEC_DR2_REG     = ADC_CFG1_DEC_DR2;     
        ADC_DEC_DR2H_REG    = ADC_CFG1_DEC_DR2H;    
        ADC_DEC_DR1_REG     = ADC_CFG1_DEC_DR1;     
        ADC_DEC_OCOR_REG    = ADC_CFG1_DEC_OCOR;    
        ADC_DEC_OCORM_REG   = ADC_CFG1_DEC_OCORM;   
        ADC_DEC_OCORH_REG   = ADC_CFG1_DEC_OCORH;   
        
        ADC_DSM_CR4_REG     = ADC_CFG1_DSM_CR4;     
        ADC_DSM_CR5_REG     = ADC_CFG1_DSM_CR5;     
        ADC_DSM_CR6_REG     = ADC_CFG1_DSM_CR6;     
        ADC_DSM_CR7_REG     = ADC_CFG1_DSM_CR7;     
        ADC_DSM_CR8_REG     = ADC_CFG1_DSM_CR8;     
        ADC_DSM_CR9_REG     = ADC_CFG1_DSM_CR9;     
        ADC_DSM_CR10_REG    = ADC_CFG1_DSM_CR10;    
        ADC_DSM_CR11_REG    = ADC_CFG1_DSM_CR11;    
        ADC_DSM_CR12_REG    = ADC_CFG1_DSM_CR12;    
        ADC_DSM_CR14_REG    = ADC_CFG1_DSM_CR14;    
        ADC_DSM_CR15_REG    = ADC_CFG1_DSM_CR15;    
        ADC_DSM_CR16_REG    = ADC_CFG1_DSM_CR16;    
        ADC_DSM_CR17_REG    = ADC_CFG1_DSM_CR17;    
        ADC_DSM_REF0_REG    = ADC_CFG1_DSM_REF0;    
        ADC_DSM_REF2_REG    = ADC_CFG1_DSM_REF2;    
        ADC_DSM_REF3_REG    = ADC_CFG1_DSM_REF3;    
        
        ADC_DSM_BUF0_REG    = ADC_CFG1_DSM_BUF0;    
        ADC_DSM_BUF1_REG    = ADC_CFG1_DSM_BUF1;    
        ADC_DSM_BUF2_REG    = ADC_CFG1_DSM_BUF2;   
        ADC_DSM_BUF3_REG    = ADC_CFG1_DSM_BUF3;
        #if (CY_PSOC5_ES1)
            ADC_DSM_CLK_REG    |= ADC_CFG1_DSM_CLK; 
        #endif /* CY_PSOC5_ES1 */
        
        /* To select either Vssa or Vref to -ve input of DSM depending on 
          the input  range selected.
        */
        
        #if(ADC_DEFAULT_INPUT_MODE)
            #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
                #if (ADC_CFG1_RANGE == ADC_IR_VSSA_TO_2VREF)
                    ADC_AMux_Select(1);
                #else
                    ADC_AMux_Select(0);
                #endif /* ADC_IR_VSSA_TO_2VREF) */
            #elif (CY_PSOC3_ES2 || CY_PSOC5_ES1)
                ADC_AMux_Select(0);
            #endif /* CY_PSOC3_ES3 || CY_PSOC5_ES2 */
        #endif /* ADC_DEFAULT_INPUT_MODE */
        
        /* Set the Conversion stop if resolution is above 16 bit and conversion 
           mode is Single sample */
        #if(ADC_CFG1_RESOLUTION > 16 && \
            ADC_CFG1_CONV_MODE == ADC_MODE_SINGLE_SAMPLE) 
            ADC_stopConversion = 1;
        #endif /* Single sample with resolution above 16 bits. */
        ADC_CountsPerVolt = (uint32)ADC_CFG1_COUNTS_PER_VOLT;
        
        /* Start and set interrupt vector */
        CyIntSetPriority(ADC_IRQ__INTC_NUMBER, ADC_IRQ_INTC_PRIOR_NUMBER);
        CyIntSetVector(ADC_IRQ__INTC_NUMBER, ADC_ISR1 );
        CyIntEnable(ADC_IRQ__INTC_NUMBER);
    }
    
    #if(ADC_DEFAULT_NUM_CONFIGS > 1)
        if(config == 2u)
        {
            /* Second Config */
            ADC_DEC_CR_REG      = ADC_CFG2_DEC_CR;      
            ADC_DEC_SHIFT1_REG  = ADC_CFG2_DEC_SHIFT1;  
            ADC_DEC_SHIFT2_REG  = ADC_CFG2_DEC_SHIFT2;  
            ADC_DEC_DR2_REG     = ADC_CFG2_DEC_DR2;     
            ADC_DEC_DR2H_REG    = ADC_CFG2_DEC_DR2H;    
            ADC_DEC_DR1_REG     = ADC_CFG2_DEC_DR1;     
            ADC_DEC_OCOR_REG    = ADC_CFG2_DEC_OCOR;    
            ADC_DEC_OCORM_REG   = ADC_CFG2_DEC_OCORM;   
            ADC_DEC_OCORH_REG   = ADC_CFG2_DEC_OCORH;   
        
            ADC_DSM_CR4_REG     = ADC_CFG2_DSM_CR4;     
            ADC_DSM_CR5_REG     = ADC_CFG2_DSM_CR5;     
            ADC_DSM_CR6_REG     = ADC_CFG2_DSM_CR6;     
            ADC_DSM_CR7_REG     = ADC_CFG2_DSM_CR7;     
            ADC_DSM_CR8_REG     = ADC_CFG2_DSM_CR8;     
            ADC_DSM_CR9_REG     = ADC_CFG2_DSM_CR9;     
            ADC_DSM_CR10_REG    = ADC_CFG2_DSM_CR10;    
            ADC_DSM_CR11_REG    = ADC_CFG2_DSM_CR11;    
            ADC_DSM_CR12_REG    = ADC_CFG2_DSM_CR12;    
            ADC_DSM_CR14_REG    = ADC_CFG2_DSM_CR14;    
            ADC_DSM_CR15_REG    = ADC_CFG2_DSM_CR15;    
            ADC_DSM_CR16_REG    = ADC_CFG2_DSM_CR16;    
            ADC_DSM_CR17_REG    = ADC_CFG2_DSM_CR17;    
            ADC_DSM_REF0_REG    = ADC_CFG2_DSM_REF0;    
            ADC_DSM_REF2_REG    = ADC_CFG2_DSM_REF2;    
            ADC_DSM_REF3_REG    = ADC_CFG2_DSM_REF3;    
        
            ADC_DSM_BUF0_REG    = ADC_CFG2_DSM_BUF0;    
            ADC_DSM_BUF1_REG    = ADC_CFG2_DSM_BUF1;    
            ADC_DSM_BUF2_REG    = ADC_CFG2_DSM_BUF2;    
            ADC_DSM_BUF3_REG    = ADC_CFG2_DSM_BUF3; 
            #if (CY_PSOC5_ES1)
                ADC_DSM_CLK_REG    |= ADC_CFG1_DSM_CLK; 
            #endif /* CY_PSOC5_ES1 */
            
            /* To select either Vssa or Vref to -ve input of DSM depending on 
               the input range selected.
            */
            
            #if(ADC_DEFAULT_INPUT_MODE)
                #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
                    #if (ADC_CFG2_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF)
                        ADC_AMux_Select(1);
                    #else
                        ADC_AMux_Select(0);
                    #endif /* ADC_IR_VSSA_TO_2VREF) */
                #elif (CY_PSOC3_ES2 || CY_PSOC5_ES1)
                    ADC_AMux_Select(0);
                #endif /* CY_PSOC3_ES3 || CY_PSOC5_ES2 */
            #endif /* ADC_DEFAULT_INPUT_MODE */
            
