kmmankad/EzI2C_WaveformViewer/I2C_Slave.cydsn/Generated_Source/PSoC3/ADC.c
            /* Set the Conversion stop if resolution is above 16 bit and 
               conversion mode is Single sample */
            #if(ADC_CFG4_RESOLUTION > 16 && \
                ADC_CFG4_CONVMODE == ADC_MODE_SINGLE_SAMPLE) 
                ADC_stopConversion = 1;
            #endif /* Single sample with resolution above 16 bits */
            
            ADC_CountsPerVolt = (uint32)ADC_CFG4_COUNTS_PER_VOLT;

            /* Start and set interrupt vector */
            CyIntSetPriority(ADC_IRQ__INTC_NUMBER, ADC_IRQ_INTC_PRIOR_NUMBER);
            CyIntSetVector(ADC_IRQ__INTC_NUMBER, ADC_ISR4 );
            CyIntEnable(ADC_IRQ__INTC_NUMBER);
        }
    #endif /* ADC_DEFAULT_NUM_CONFIGS > 4 */
}


/*******************************************************************************
* Function Name: ADC_RoundValue(uint32 busClockFreq, 
*                                            uint32 clockFreq)
********************************************************************************
*
* Summary:
*  Function to round an integer value.
*
* Parameters:  
*  busClockFreq:  Frequency of the bus clock.
*  clockFreq:  Frequency of the component clock.
*
* Return: 
*  uint16: rounded integer value.
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
uint16 ADC_RoundValue(uint32 busClockFreq, uint32 clockFreq) \
                                  
{
    uint16 divider1, divider2;
    
    divider1 = ((busClockFreq * 10) / clockFreq);
    divider2 = (busClockFreq / clockFreq);
    if ( divider1 - (divider2 * 10) >= 5)
    {
        divider2 += 1;
    }
    return divider2;
}
         

/*******************************************************************************
* Function Name: ADC_SelectCofiguration(uint8 config, 
*                                                    uint8 restart)
********************************************************************************
*
* Summary:
*  Selects the user defined configuration. This API first stops the current ADC
*  and then initializes the registers with the default values for that config. 
*  This also performs calibration by writing GCOR registers with trim values 
*  stored in the flash.
*
* Parameters:  
*  config:  configuration user wants to select.
*
* Return: 
*  void
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
void ADC_SelectConfiguration(uint8 config, uint8 restart) \
                                              
{
    uint8 inputRange = 0, resolution = 16;
    uint16 idealGain = 0, clockDivider = 1;    
    uint16 idealOddGain = 0;
    
    /* Check whether the config is valid or not */
    if( config <= ADC_DEFAULT_NUM_CONFIGS)
    {   
       /* Set the flag to ensure start() API dont override the config
           selected if ADC is not already started */
        if(ADC_initVar == 0u)
        {
            ADC_started = 1u;
        }
       
        /* Stop the ADC  */
        ADC_Stop();
        
        #if (CY_PSOC5_ES1)
            /* Set the structure field which checks whether or not to
               restore the power registers */
            ADC_powerModeBackup.bypassRestore = ADC_BYPASS_ENABLED;
        #endif /* CY_PSOC5_ES1 */
        
        /* Set the  ADC registers based on the configuration */
        ADC_InitConfig(config);
        
        /* Trim value calculation */
        if(config == 1u)
        {
            inputRange = ADC_CFG1_RANGE;
            resolution = ADC_CFG1_RESOLUTION;
            idealGain = ADC_CFG1_IDEAL_DEC_GAIN;
            idealOddGain = ADC_CFG1_IDEAL_ODDDEC_GAIN;
            clockDivider = ADC_RoundValue((uint32)BCLK__BUS_CLK__HZ,
                                                       (uint32)ADC_CFG1_CLOCK_FREQ);
        }

        #if (ADC_DEFAULT_NUM_CONFIGS > 1)
            if(config == 2u)
            {
                inputRange = ADC_CFG2_INPUT_RANGE;
                resolution = ADC_CFG2_RESOLUTION;
                idealGain = ADC_CFG2_IDEAL_DEC_GAIN;
                idealOddGain = ADC_CFG2_IDEAL_ODDDEC_GAIN;
                clockDivider = ADC_RoundValue((uint32)BCLK__BUS_CLK__HZ,
                                                            (uint32)ADC_CFG2_CLOCK_FREQ);
            }
        #endif /* ADC_DEFAULT_NUM_CONFIGS > 1 */

        #if(ADC_DEFAULT_NUM_CONFIGS > 2)
            if(config == 3u)
            {
                inputRange = ADC_CFG3_INPUT_RANGE;
                resolution = ADC_CFG3_RESOLUTION;
                idealGain = ADC_CFG3_IDEAL_DEC_GAIN;
                idealOddGain = ADC_CFG3_IDEAL_ODDDEC_GAIN;
                clockDivider = ADC_RoundValue((uint32)BCLK__BUS_CLK__HZ,
                                                            (uint32)ADC_CFG3_CLOCK_FREQ);
            }
        #endif /* ADC_DEFAULT_NUM_CONFIGS > 2 */

        #if (ADC_DEFAULT_NUM_CONFIGS > 3)
            if(config == 4u)
            {
                inputRange = ADC_CFG4_INPUT_RANGE;
                resolution = ADC_CFG4_RESOLUTION;
                idealGain = ADC_CFG4_IDEAL_DEC_GAIN;
                idealOddGain = ADC_CFG4_IDEAL_ODDDEC_GAIN;
                clockDivider = ADC_RoundValue((uint32)BCLK__BUS_CLK__HZ,  
                                                            (uint32)ADC_CFG4_CLOCK_FREQ);
            }
        #endif /* ADC_DEFAULT_NUM_CONFIGS > 3 */
        
        clockDivider = clockDivider - 1;
        /* Set the proper divider for the internal clock */
        #if(ADC_DEFAULT_INTERNAL_CLK)
            ADC_theACLK_SetDividerRegister(clockDivider, 1);
        #endif /* ADC_DEFAULT_INTERNAL_CLK */
        
        /* Compensate the gain */
        ADC_GainCompensation(inputRange, idealGain, idealOddGain, resolution);
        
        if(restart == 1u)
        {        
            /* Restart the ADC */
            ADC_Start();
            
            /* Code to disable the REFBUF0 if reference chosen is External ref */
            #if (((ADC_CFG2_REFERENCE == ADC_EXT_REF_ON_P03) || \
                 (ADC_CFG2_REFERENCE == ADC_EXT_REF_ON_P32)) || \
                 ((ADC_CFG3_REFERENCE == ADC_EXT_REF_ON_P03) || \
                 (ADC_CFG3_REFERENCE == ADC_EXT_REF_ON_P32)) || \
                 ((ADC_CFG4_REFERENCE == ADC_EXT_REF_ON_P03) || \
                 (ADC_CFG4_REFERENCE == ADC_EXT_REF_ON_P32)))
                if (((config == 2) && 
                    ((ADC_CFG2_REFERENCE == ADC_EXT_REF_ON_P03) ||
                    (ADC_CFG2_REFERENCE == ADC_EXT_REF_ON_P32))) ||
                    ((config == 3) && 
                    ((ADC_CFG3_REFERENCE == ADC_EXT_REF_ON_P03) ||
                    (ADC_CFG3_REFERENCE == ADC_EXT_REF_ON_P32))) ||
                    ((config == 4) && 
                    ((ADC_CFG4_REFERENCE == ADC_EXT_REF_ON_P03) ||
                    (ADC_CFG4_REFERENCE == ADC_EXT_REF_ON_P32))))
                {
                    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and 
                       REFBUF1, enable PRES */
                    #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
                        ADC_RESET_CR4_REG |= ADC_IGNORE_PRESA1;
                        ADC_RESET_CR5_REG |= ADC_IGNORE_PRESA2;
                    #elif (CY_PSOC5_ES1 || CY_PSOC3_ES2)
                        ADC_RESET_CR1_REG |= ADC_DIS_PRES1;
                        ADC_RESET_CR3_REG |= ADC_DIS_PRES2;
                    #endif /* CY_PSOC5_ES1 || CY_PSOC3_ES2 */
        
