kmmankad/EzI2C_WaveformViewer/I2C_Slave.cydsn/Generated_Source/PSoC3/ADC.c
                    /* Disable the REFBUF0 */
                    ADC_DSM_CR17_REG &= ~ADC_DSM_EN_BUF_VREF;
                    
                    /* Wait for 3 microseconds */
                    CyDelayUs(3);
        
                    #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
                        ADC_RESET_CR4_REG &= ~ADC_IGNORE_PRESA1;
                        ADC_RESET_CR5_REG &= ~ADC_IGNORE_PRESA2;
            
                        ADC_RESET_CR3_REG = ADC_EN_PRESA;
                    #elif (CY_PSOC5_ES1 || CY_PSOC3_ES2)
                        ADC_RESET_CR1_REG &= ~ADC_DIS_PRES1;
                        ADC_RESET_CR3_REG &= ~ADC_DIS_PRES2;
                    #endif /* CY_PSOC5_ES1 || CY_PSOC3_ES2 */
                }
            #endif /* */
            
            #if ((CY_PSOC3_ES3 || CY_PSOC5_ES2) && \
                 ((ADC_CFG2_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF) || \
                  (ADC_CFG3_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF) || \
                  (ADC_CFG4_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF)))
                if(((config == 2) && 
                    (ADC_CFG2_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF) && 
                    ((ADC_CFG2_REFERENCE != ADC_EXT_REF_ON_P03) && 
                     (ADC_CFG2_REFERENCE != ADC_EXT_REF_ON_P32))) ||
                     ((config == 3) && 
                      (ADC_CFG3_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF) && 
                     ((ADC_CFG3_REFERENCE != ADC_EXT_REF_ON_P03) && 
                     (ADC_CFG3_REFERENCE != ADC_EXT_REF_ON_P32))) ||
                     ((config == 4) && 
                      (ADC_CFG4_INPUT_RANGE == ADC_IR_VSSA_TO_2VREF) && 
                     ((ADC_CFG4_REFERENCE != ADC_EXT_REF_ON_P03) && 
                     (ADC_CFG4_REFERENCE != ADC_EXT_REF_ON_P32))))
                {
                    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and 
                       REFBUF1, enable PRES */
                    #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
                        ADC_RESET_CR4_REG |= ADC_IGNORE_PRESA1;
                        ADC_RESET_CR5_REG |= ADC_IGNORE_PRESA2;
                    #elif (CY_PSOC5_ES1 || CY_PSOC3_ES2)
                        ADC_RESET_CR1_REG |= ADC_DIS_PRES1;
                        ADC_RESET_CR3_REG |= ADC_DIS_PRES2;
                    #endif /* CY_PSOC5_ES1 || CY_PSOC3_ES2 */
        
                    /* Enable the REFBUF1 */
                    ADC_DSM_REF0_REG |= ADC_DSM_EN_BUF_VREF_INN;
                    
                    /* Wait for 3 microseconds */
                    CyDelayUs(3);
        
                    #if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
                        ADC_RESET_CR4_REG &= ~ADC_IGNORE_PRESA1;
                        ADC_RESET_CR5_REG &= ~ADC_IGNORE_PRESA2;
            
                        ADC_RESET_CR3_REG = ADC_EN_PRESA;
                    #elif (CY_PSOC5_ES1 || CY_PSOC3_ES2)
                        ADC_RESET_CR1_REG &= ~ADC_DIS_PRES1;
                        ADC_RESET_CR3_REG &= ~ADC_DIS_PRES2;
                    #endif /* CY_PSOC5_ES1 || CY_PSOC3_ES2 */
                }
            #endif /* (CY_PSOC3_ES3 || CY_PSOC5_ES2) */
        
            /* Restart the ADC conversion */
            ADC_StartConvert();
        }
    }
}     


/*******************************************************************************
* Function Name: ADC_GainCompensation(uint8, uint16, uint16, uint8)
********************************************************************************
*
* Summary:
*  This API calculates the trim value and then loads this to GCOR register.
*
* Parameters:  
*  inputRange:  input range for which trim value is to be calculated.
*  IdealDecGain:  Ideal Decimator gain for the selected resolution and 
*                 conversion  mode.
*  IdealOddDecGain:  Ideal odd decimation gain for the selected resolution and 
                     conversion mode.
*  resolution:  Resolution to select the proper flash location for trim value.
*
* Return: 
*  void
*
* Reentrance: 
*  Yes
*
*******************************************************************************/
void ADC_GainCompensation(uint8 inputRange, uint16 IdealDecGain, uint16 IdealOddDecGain,  \
                                       uint8 resolution) 
{
    int8 flash;
    int16 Normalised;
    uint16 GcorValue;
    uint32 GcorTmp;
    
    switch(inputRange)
    {         
        case ADC_IR_VNEG_VREF_DIFF:
        
        /* Normalize the flash Value */
        if(resolution > 15)
        {
            flash = ADC_DEC_TRIM_VREF_DIFF_16_20; 
        }    
        else
        {
            flash = ADC_DEC_TRIM_VREF_DIFF_8_15;
        }        
        break;
        
        case ADC_IR_VNEG_VREF_2_DIFF:
        
        /* Normalize the flash Value */
        if(resolution > 15)
        {
            flash = ADC_DEC_TRIM_VREF_2_DIFF_16_20;
        }    
        else
        {
            flash = ADC_DEC_TRIM_VREF_2_DIFF_8_15;
        }    
        break;
        
        case ADC_IR_VNEG_VREF_4_DIFF:
        
        /* Normalize the flash Value */
        if(resolution > 15)
        {
            flash = ADC_DEC_TRIM_VREF_4_DIFF_16_20;
        }    
        else
        {
            flash = ADC_DEC_TRIM_VREF_4_DIFF_8_15;
        }    
        break;
        
        case ADC_IR_VNEG_VREF_16_DIFF:
        
        /* Normalize the flash Value */
        if(resolution > 15)
        {
            flash = ADC_DEC_TRIM_VREF_16_DIFF_16_20;
        }    
        else
        {
            flash = ADC_DEC_TRIM_VREF_16_DIFF_8_15;
        }    
        break;
        
        default:
            flash = 0;
        break;
    }    
    if(inputRange == ADC_IR_VSSA_TO_VREF || inputRange == ADC_IR_VSSA_TO_2VREF || 
       inputRange == ADC_IR_VSSA_TO_VDDA || inputRange == ADC_IR_VSSA_TO_6VREF || 
       inputRange == ADC_IR_VNEG_2VREF_DIFF || inputRange == ADC_IR_VNEG_6VREF_DIFF ||
       inputRange == ADC_IR_VNEG_VREF_8_DIFF)
    {
        Normalised  = 0;
    }
    else
    {
        Normalised  = ((int16)flash) * 32;
    }
                    
    /* Add two values */
    GcorValue = IdealDecGain + Normalised;  
    GcorTmp = (uint32)GcorValue * (uint32)IdealOddDecGain;
    GcorValue = (uint16)(GcorTmp / ADC_IDEAL_GAIN_CONST);
        
    if (resolution < 14)
    {
        GcorValue = (GcorValue >> (15 - (resolution + 1)));
        ADC_DEC_GVAL_REG = (resolution + 1);
    }
    else
    {
        /* Use all 16 bits */
        ADC_DEC_GVAL_REG = 15u;  
    }
      
    /* Load the gain correction register */    
    ADC_DEC_GCOR_REG  = (uint8)GcorValue;
    ADC_DEC_GCORH_REG = (uint8)(GcorValue >> 8);    
    
    /* Workaround for 0 to 2*Vref mode with PSoC3 ES2 and PSoC5 ES1 siliocn */
    #if( CY_PSOC3_ES2 || CY_PSOC5_ES1) 
        if( inputRange == ADC_IR_VSSA_TO_2VREF)
        {
            ADC_DEC_GCOR_REG = 0x00u;
            ADC_DEC_GCORH_REG = 0x00u;
            ADC_DEC_GVAL_REG = 0x00u;
        }
    #endif /* CY_PSOC3_ES2 || CY_PSOC5_ES1 */
    
}        


/* [] END OF FILE */
